//
//  HiraganaKatakana.swift
//  OCRSample
//
//  Created by 김호성 on 2024.11.16.
//

import Foundation

class HiraganaKatakanaManager {
    public static let shared = HiraganaKatakanaManager()
    private init() {}
    
    let hiraganaKatakana: [String] = [
        "あ", "い", "う", "え", "お",
        "か", "き", "く", "け", "こ",
        "さ", "し", "す", "せ", "そ",
        "た", "ち", "つ", "て", "と",
        "な", "に", "ぬ", "ね", "の",
        "は", "ひ", "ふ", "へ", "ほ",
        "ま", "み", "む", "め", "も",
        "や",      "ゆ",       "よ",
        "ら", "り", "る", "れ", "ろ",
        "わ",                 "を",
        "ん",
        
        "ア", "イ", "ウ", "エ", "オ",
        "カ", "キ", "ク", "ケ", "コ",
        "サ", "シ", "ス", "セ", "ソ",
        "タ", "チ", "ツ", "テ", "ト",
        "ナ", "ニ", "ヌ", "ネ", "ノ",
        "ハ", "ヒ", "フ", "ヘ", "ホ",
        "マ", "ミ", "ム", "メ", "モ",
        "ヤ",      "ユ",       "ヨ",
        "ラ", "リ", "ル", "レ", "ロ",
        "ワ",                 "ヲ",
        "ン",
    ]
    let hiragana: String = "あいうえおかきくけこさしすせそたちってとなにぬねのはひふへほまみむめもやゆよらりるれろわをん"
    let katakana: String = "アイウエオカキクケコサシスセソタチツテトナニヌネノハヒフへホマミムメモヤユヨラリルレロワヲン"
}
